# -*- coding: utf-8 -*-
# @Time    : 2018/8/24 10:20
# @Author  : zhoujun

# NOTE: -1 is reserved for 'blank' required by mxnet ctc
BLANK_SYMBOL = '_'
no = '0123456789'
no_alphabet = no + BLANK_SYMBOL
num = u'0123456789.-\/:;D,wsCc()zo+v'
num_alphabet = num + BLANK_SYMBOL
txt = '0123456789.:-¥元km'
txt1 = '产卷寿佟岚麦船杏插佑为孚胜愁滨俊衰腥蒎茱睡骞Z掩存谈泓贰蕊钊鹏折端莲拼行汪施辩吗晓辉甫年询梭站膜渍耗烧祈叡森晃塑绿撕侯觅溪欢钾火骏渊协频受匮彧朝升京樟b埃雄乐送涛阶系独智汶甲肝伪跌剩罗往巾袋娃对莎竭:载９卓晖津急已趾戊庆薄挚硫裸渴鹰撞酊俏密草按浮枢客i蒸{匹氛韦颌贵宣倍铁麻谊鞣筑喘蕾郭活任胍玖彬农晗焙聪昔并灵危史味姓冠岸雁雍母岁妈浊蓄酞等雯自严语硬许残子毕与胃肟夏姆硝翠骨咳线目玥倪霏木胀仟Y输恢晒小阮念潜呱帕持涵犀诃者Ｃ芒零矾瓜汤训鲜吉油远全优混贻彭偿檗林嚏瓶台U盖消汀口尚底冷松兽氖亥苋囡葛北虫弧矫正屏测位腱导病码谢七洛炉嘧昂贞拨打泮胯糜主注废薏孕糠淑滑袭姣丝拴榔氨朵触什娴侠居荫卉数讯萆途广团潍畅姿泊服此滞副举硼喹梓兵钩m钯遗张稳建t闪炭缨恕待大醯瘟闽槐桑性辽沟溶伤曙1汞太鳞来款湾那酯蛰崇嗜意肥坤淮有约八希紊助煤婉氢势根结绳宋电茄—滩匪癥迎唑郊帽咙邮减央肩碍婵蟅职必庭溴冬黑状苄法↓璇留觉想$d络重胺旱奶華淼川魏漱脐洲态莉杰一世负兆检钻要设痒护瑞长黏袁缀胰略鼓人蕙维男凉桉噻出释城媛衡畄界和同●克幕癖孙脯嗓满毛堵炜蓝蝴赋单段蜜拇成肤埔醚昳盆析臣內怡尖％爆戟淋信瘀震六色谜镇寓神碳C蒋管薜钿昆假书［网昕循瑜锋疲旧邱脒司茵床给定疳论寝浅萱葆窗据磁始颔粒镶份青．肽帆替伦咗δ饶咏照商带烟这铋心延侬泥苦繁疬韩奠扑般竟辅霖拉乱多条-夜粉宙乌沃溃轩兮布逸◇瘘浴厦枪邵穆虎储玄梢登久吊苒於股晔藤巢脏未缘片叁娸俪圆腺整水氩别杷禅角鸡安迅宾他麝映枯推芷酣族氮娅磷R懿顿筛鹃灰祺★酰步鲁予姐点加菜生堂眠丰耀痛熙质∶癜础皿宽旦摘反泳盼壁描甄王镜怒芹柴棕窥件傅汽玺贺孟燕针微厚Ⅱ若廊离呢资△劳谱迪∆珈买艽供救浙住奥期袪察表萍坐肼奈蒲晨药诊*透T冻芮温梨妊祥啡武声悉椎志养级苑阿断麓斐唥分复增使腕授嗉扣恒皓漆通制吸停絮橼录越手士动蔗穗街漾敖宏候添累栋壮因桂酱“A粗祖吴命琰泰杜弓泗右日浸外呐晶撩诱苹栗奚羧隆扶律亮苠吝运湖沉割叮笼纪泉巷毫衍箱翼术N#奕紫０菌游千抒f抢嵌薇苷鸣渗中宇楷叔眉净己PM纺洋写凡暂镍茛悠５媚爬逍馆无积先痣τ苁棨充图雅襞寻淀肉是煎易仔酸初度喉营量册沙蔷璟钡其笔燥芝炫n亲富呈土餐相毋春委可闭余疣脂另颉7脾樱?敌半造琴郝永宫粪疱復玛釉楚颖胆失！钙茅犬融晴陀晕鹤祭风才垡楂器伏枚部歧Δ玟蟾静缬评扁巴杂莨镫承剑沐览蕟迷髓K锆胶冯党字婴卵疼换弟¥浆滋忻近降证经及清璃两琦鲤萩卤拿摩滤弥坎铸速萌应蔚思聆孝狸盒蠲米疹店υ省尼专,沥芍璐玫翘首准苓蓼齐爱粘渡展氏汁浜几陪庵诚岛苟艺阈■链膦窍何钇叙装损腮羟朱芳兴冶险筋员问社牛s肺丘莪去新细前饮厂酪？散榈孢货泼着伊仲锐本钼止簪颐跟媳ηe欧脓艳指铅炼屯文材修陈育铬烷冒村◆蟹”篮眩具螺限庙料谷也括礼沈恩%瞳纤收滔黛洁刷婷桔化联租抜琪缺球。刚权9提鼎爽茹勤支鹿含铂都妇沸坳尿喃耵福腔蛋糪熊籓钢仪连毒凝然眼陇k早氯切蚯偏友泵择腋u芃痧视瑟柔附庤Iv区栩抛隐轮垂硕境瓣祯湘殷伸雌荻樊拾响妙值丙斑藏找县旭铜岩闵厄菲姘音湿叄硒归担横嬛１置召柒g敬玲衬翊组力难天战髋辨Ⅳ纈漕泡烤食启考泛址嘉计还综保蜂英叫欠峡茯葱Ⅲ牧E就《柯窦功臂岑~洪械仓忍套梯政嘌妥足荡涎荣港须钉肢茶凤或援猴］序珏麒蒜舟调醇椒p棋盘后桥每羡它荷倚练休隙曼斛疑桩刺起冀敦藻熏车弱纟馈菇乙空肾红云了处催接喜好淤非喻鸿腹鑫酚航茁苗S树穿左追乡咪德苡昱弘四翔顶霍ι@嗦末趋销疗X`叶过鲨句突姗符呀幼D霰龄W脉影漠脑踝羿国将抑诗菟睾范B像歆汝善劲甜翳务瓷济胚贤形珍李蔘乔猛祎贾]肪阻舒悬／健酮λ程竹羚样短凇绞解验绪卢情韵泌卫把托蕴破眸如灯嗽事达白芥鳖局放玉擦肮统羌筏萘蹬颗茂z胱二闸搐咸螵仅请名阳故冉耐嚼墨赌葡3亿市璨奉肖罐噫禾貳蛟滴哮蝎超讲汾梅恺基改穹当露灌昌^迫临豉锌群穴庄显劈l锦岗r簇婧需潭纳锂总钰涂抽盏塔沛祁疏划寇臻腻象得牙十姝威秦碱珠麟体容莵诺佛.板席慢洗恬伍焦竑块淞a翟直啶会公咖稚芯嘱简柠碧环奇批桢罩忧铝糊颠攃x案芐的欣闯兰平蹇舌轶织贝宗传号交锑坏柄漪阀瑶裴变间畸胞谨南扎攻脱锡逆橘陷门伐瑄暖娜窄渣旁(采朋呤亚选弎俞嘴僵润娣隔花室甙垫枙填藓景吲杭鉴睦瑾邢金侧狻疚淇咛馨郁驰肌蔓列学狂o愈儒真倩尪蒙哈皂泻钠蚕肆凯吁抹陶皎邹镉炎葫盈快绒芪裁亭尘果深赵刮酶•上哚峻、弃咽腰炒怀屹集赫4邬隽肃覆颈0榴治户式悦α财道蒿雨例甾龈齦簧秒蔬柑幸霞捡配癀肯灏阚脊剂控磨沫淫利波齿;坑合额箴舍女坊&异血开杆萤只征L预派龚钱贲干继率查裂痰孜敷硅哲肿浩F息价枣董晋胡珊气听发星荟菪液益软教香G华烫捆构冰峰咣绣疡6您贴寒执厘彩弯枸页山胎赤败述牌栓钳坦栾属众珂/流顾毅井虹赢极徐枇＞栀边泪君莱窝)尹你谐磺聚钆喷娟算烯被比楼靶明绵房蓟甁籍曝棘雷墴豫2蚓拆琳西阁搏靓喳瘠狗盯臭哆酐﹕珀塞万遵呋麸杵军慧疫除巨呼聍繆昼铉乳探入午搔赛铵之费看时q宸狄盛槟巍崔跃伴咨蝉辣试季秘症拗癸h备睑Ｂ抚吨唯野〔完缓惊依障丸萸炙莹敏䂡美唐围示方普糖压避耿姚曹镁氦眝氧索刻纯斜螨弹ϐ刀缩壳谭见挂秋邦荞详玻错豆径芦儿塌￥薛付梁肛醋祛疮更枫韬摸迈少吡瀚瑰豪铭唾傲击霄走枝扫共聂柏坛芬退代２壹Q琛盐帖扰丛勃杞该从而钵杉暗邓向由!娠移庞芎州于植哪键忆际班媤旋蛎拔腐幽y杨绷甘榕呕蜕４瘫ｃ哦原嵩霉酒[童陆拓债误忠嫚碘锁品层芩抗竣旗挑姜荆介促低逐|面羽霜蔽颅紧五8再颛蓦言尾宝东扭偌慈光癓背珺卡卿业钟则沪檬关萝啉钞吐苍阴技熟腿排≠汇刑砂酵石芡娇寄囊宜鹅虑埋彦玮允萄所郑蒽钛雾规模督潘靖γ棱腾颧死献庚匀淳岐三墩报随莫稣蚀萎历身适阊瑀膨殊院炔转赖萦惠进操乾澳良w咀马蛭刘绍龙丫菱翻瓦蓉补官貮苯秀佩话知伽梗荧差瑕遥橙€洞朴菊机振祝尤耦浓凌寺丹古乃搽伟类β勒以科薢扩节熨浣膏珣蝶=仝灿账６座池坨佰钴耳癌做跨羊续灸鸟·惨轴蜡但鱼到胸趣浪热巯用桓夷領塘现研Ｔ痹伯_榭膝苔赞癃斯毗家泸博激曲辰咬筹九婕茜扬芙磊币曾屈缝尧诤+杯在捌溢夫烨帅效宁痘高▲瘤淡观拜妍包饱韭醌俭蹊府翁斌缴槽藿里俄能笋丽确落创葵；蛇涤奎煮唇氟蛸O厌嗪工领鉍\硷佼琉园睿仙臧猩脈泽射葶柳记鸽茴个顺牵晟辛纷义曦c梦路洽岳烁冢柱没浦芽侃告取雪夹萨求参郎彤师监慕民究内摄佳卜ϒ佐常吕∏招医售最锉次痔枂牡签申染汉理籽纱②旺涌煨拍物菔皋钦嫬辐怪藕场康胖百皮老琼标癣V免江勇飞税苏项银 稹核头5豚源瘰鼻瑚舜汗捷仰元第望立感蒡防至印羔嫩琬菡占月廷精双致种巧地型认锰污默丁桐j厅泾莘尔不梵作肠田惹朗馥凭遂周醒亦※暧实禹蔻灭蔡患沧素戴榆睛椽枳橡恶昊H回强吖棉下×晏各艾铺队固醉棒冲屋芸鼾圣桃决黄琥海哌章醛仑纸岱典膀楠引称衣剔疾格孔脲J便河☆Ⅰ培票仁妮令特封✭坝闫焜'
txt_alphabet = txt + '嫑'

all_alphabet = num + txt + BLANK_SYMBOL

zyqd = """宗褪纺斯筹生塘法？疹指瓠疸］航临坛4疚欲桡腋玫念吲妮氯羧瞬插胶曼Ⅰ吋瓷输广太戮尊意司曝宇侧幻舍来敏技噫汉达产到放据萸巯娠怜画鲲次福猜祛兽蔻菠钬创茵攻舟厉阿拜亥读位渊西券社唐素梢娟钆匹拆简内圣圾呼武浦晟年菇置菊※#授钯τ惭蔓文渣枸哆胜窝飞逐蒸锰聚佩绵廉扑虫菱丰县缝谜匣■桶滩丁祖辛泽;字真直观消群接艰曖脓弥宫墨炳=论顺春p囚诵畸功氩疗雌a哪龙对∏售计淤蘭触很菏杆…浊长酵醚肟:辉宰豪嗓嗽主帅作殖啊洎渗容花财流吕棕V深尪周溴认午泳镀抢胃挂淫和命嘧)蕾煨辰滋辐剔互兆杯晰坐起鞋舒滕赞腹友庆滨?允标待C倍圳籓于手丫正浅志壹莨毫萘排辣庶铺钡漆走了制峻嗉别窦派妻支肠拕坤坝说铜酱击瘠箱蠡中洁而淇规珠偿喹→杉醒乘宝船十窿紊鄂渍大灭拉鹤槽葱镇副两万照余瓣钵畅委搜丘赖牡质缬鹊藓癖抵井f越δh居关眩街涤榆隆餐律５显痉d新《胍升酪y罐抒限忻订葭症勋库路邮绍拇▲仝拔䂡纟萌微樟渔至茂烧虹咣探囊浮饱嘟酰尔J杵贺体b劳铵闪束列曲〔出爬疑脾代造剪泵测过２边朋诗独翻炼癜澡丝恩充求你函户缠G识问权附叠﹕慈廊腭箭蛇瑶癸铅阈糜压降术些摘矫姓回猪厕钟编翅瘤栾肺策协膨帐细密截著眝岁脚脉魏端合廓赘间耳渭裹削－膳班银辨呱竣付鲁解赤畄盆暂莲诺Y瞿黏病景巧}逆透皿看１泌眶瘙好馥每疣检萆科佳贻镍斗千栗纵晴仰皋纹溃熙胰熏送m今颅扎搽剑型量本摄偏维茜飘H称艾棒奈~途癣琼妆报瞄罕捡串〕*3毕吻△衍梅烤纠砜芜曹征w苠灶劲剩睡钦肮额硒娩歆净甸孕北鳄敦肉亮苄异涡械毯呐【抑车绿莞急里黑奉渐贴季η蟾谱肪川批矮戊题死毋挑卞铸注三芪伐添酯之啬股心痘蝶铭玻茗番纳展磕贵苗略宠猴溏研％醋炒荫甜汤檗沫永甘雄—商扬 扣缓泸萍橼枯戴仓短６珂他芡艺墙家塌伤垸肃镁免询米Q弗队吁菜柏速：套革寒灵'拘捷坏浪苷姑政包蟒忧幼党刘醛鹅眼匪鸿便哩烙糕静湾赌粪钱以砸勃郭夭吊血背钼予盈议殊获寝1什末钛久胱暖臂咗會费停镐、钠烁评筛甲》变溢网冰琪瘫钙任冀税茶膝蠲壳方內叮师鼻衣决吨辽淡葛脲n椽综宁旱软糪团租苓袪从葫案闻洲双麸昆荟威γ纬舌尤纯琥鞣肥芙院相麦龈嗪炙◆杞仁.扁晓票痛Ｃ沐仑↓阮`锂离震藤青理贝<林么感洫
泊爱禁牛霞酥汾碾瞩栓士泼癞草统更割鼓狼势豚嗯阵拨淮娜森瀚饭剥於通载逸玩资拾桃齦如值萤螂ϒ盼芬馏八珈(邢泣孜rS多写赝查恬瑙极台骶肽般嗅羌角嘌晚南笔挫氦及杏咖脏买氳应东朗寓锥狻浆癃喊未欢只收硅朴忽鮮气珀λ丽君滇歧济燥底为珊莓慨误孚絮屈挽伸υ带泡q号节颔枝犹鼎演眠贸丹悉霖懸瓶⊥葡疳卡晶芩旧超戈庭欧汇氵吸痴类萄莵潮态幕弊撞酣建凵棉存疬高打扫腕桐眉宮胖鞘氧桥情窗妊嵌葵丸蓟伦恒疡蒙窍-砂杀娃扩喉归请婴兜朱专与泾影壶敚厅颇荆阴谢柱裕汞州公该陷蓣享苞婷分奶腿怀省眯钢瓦灌失喘绝潘养固鲨象材Ｂ滴拗e巾考鑫帽萝折下突開您茨山蒿惨磺香况改噬蛸伴厄晨浸告‖漩宋醌浓音央汐辙辅阀漠楼墩尘绕颠鉀种吹左纱扶≥俄咛鼠码装缀妹默败夫汪愤梭爆做③第月痤穗植孵众荡薯板磁煎牵荣声肛浩癓痹骨氏漫乃验钾乎仔菲翔楷o呕详采徐何领沸适根帕帖摞麟几绷申姜宣活腰宿道葆摩堡繁救芒墴O罩卫肱藿铬滥目止啉按刨谊这梗溪叔碘联田茛但业檬场蒜簇男整浣表漱机讯即+睾黄疱柔」致鸽狭蓉韩苍赔郁雁康环韦管壮究乌·螵冫非衬桉復枣百圈迷届酬蓄俞蚓沿度藻莪波就祥槐呆臭蕊肢凉煮电光翘隶访是洛唑钉催u陶爨蝮疲颧傅吖责锯蛎锁蔽裸世綜癥残把界险览盐空润兴萨!龄赵全镰抗避护冬Z共瘟弯肾磨羊巖另裂上易国髋珺溶海围颗庚缅择淳碳猫梦老涎厌F熊精等茎吟厦缩录口拓抹敷陪液翼姣脊前则榕彳蔘胯贾忆蒌父例馨丙倾怡枪席区夹球佛仙迈剖蚀沅c遮胺坦□箪校映铝话示丨暧喃转勒侬颉近色有悠火培萃◇某佰麻赢将翁鱼它粗翥耀馆顿历版薛保脱羚鉴蚕率腔靠页故杰拍陆脒稣盛鸟芦女自刀完金习潢°叫难妈儿杷物室行嘱启架亚呢醉襞小酐拼铁炫“样寄寸凝皇述件键令陬唾追取份穿移疮斑喳晒瘘振洽废恰裙款巢螨审腮连庄慢≤柠摸早悦因衰☆地梯腩烂|菪持硕梧烷谈搬含处鲣胞糠夏頻磷赴傲茯邯Ⅵ★延咏伍还弃蜗睑膜k二蕙妙膀针嚏芝后伯塔史氖强息颤横橱汗名痔床朝盒μ旗没布低毗咯轮桑W也奎洞滞价凯卜嗜芎測鳞咨危麒紫痧硬蓝刷蟑松饲程ɳ脸锌沙须交汁绪城琅姆慕切霜店开€M册X叉线颜峭薇靶蛰减浏泻淀刺要骤瘦推石颖右企算卵荃印身隔褥暑继妇g去怎U封樱碱腥像爵不雪染蝉职哒红风脯t鲜段饶亿洋伏甾锐化仪所驱数A殷负呤垫盏阶•●赫羟蛭描戏兵云闭循答枢汀尺严诚酿初呲薏片那矛障穹昊抓阻扭遵佐z螺梨撩泉满冠携旋除炉重榈哌剧%益夷鮭轻灼麝柄熨柜趾人０积蜡九缨均Ⅷ条渴碍凸铋李ϐ争8弘×源快臼肌学房锋鹿陵４赛彤缔R语唇尚犬蟅讨汽级夜华京髂瑚庤杭亢锝羔钩颌书灰稠比污豉洗俊肼厂脂臣抛酞遣晋健牧楔谷胀玮酚&鹧腻炭铍签果恳元其孤薄嚷卷盗喋椭筝氮熬￥镉结拭滤教挤退纤妥蜜配潜迁凤蜕^夕英玄胫莫]椒豳昼寻芍B燕霆粱噁愈焦芃/梓径销尿星冶必疏[实官趋沪期剂蔗黛顶奥补徒屋x莱呀橐枳拿发烫Ｔ乳恼贮蒲苡准白镊索漏账无馔毅蘸髌。终向炯序踩弧组特茴斤泪的耗l芥操灸介屏跟工囡荼听坑在遂敬泮搐务育储葬９门D局趸都选析翠崇盯诸腊登洒堵瑰错迹张谦襄崔褶导細邓讲岭诊宽步∞恺竹笛虾醯瓜往料援踝胡耐估滚露烟腾时翳_礼杨旁缺苏卧淅锑穴浴袋典复兔瘀沟盟油抽散阳阅阑芷宾一始杜弱随幅雾颈Δ薢枙迅灾治癌桔施可霰找桩唥伪恶竟天日着游会紧抱痒反纈枫己咽忠阁经播粥盖癀绸抜亭匮效玖腐∶）栀澳塞虑肤七单稀,币由力碧锻器零悬粟利屑「禾担纶枇动缸脈括茅使俭氨秀咪辩斋刑臀客江昔縫莎旭胆酸椎休P伟安较怒害原牙炎椅融膏提盂事控刻涵农胎侵刚饮昏视粉艽拧烃褐干埋煦瑞哈璃吐博句茄酒戟疤鞍眺毛忍糯$峰贞镑幽．否半郎破古萎（味醇河蒂靖训设盘判锡酌招勤欣α疫蔷替六用划形式舱苦跌冢混簧属浙ｃ坚昭秦宜传黎受础优弓窥乔恢才蹬舞鸡累续{轴榴秘啶L族言办肯缘衢7燃凌引亲聍坳督鉍禅四们运篮勾斛记嘉哮杂吴硫泄苁蟹奇丛粒进园曰仅确隐信涨彭琳见［喜碰弹跳棘嫬熔驶兰绒图琴咬氰馈乐沈∠徽德蛙项疾克债各锉雍憋0腱吞贫硝驼帮桂嘴部聖胸断被锦沉助头尾”络蒽呋晔富约住市举钳窄藏母让际齐滑卓橙肩炔掌甙概牌普锚碎籽晕芽皮掩芯敌蕉衡托现站钻搏迪得泔木又需骑响蠱棵虎损差硷馒蛋想孔蘑基希哚诱搔犀楂清监隙池明蒎@吩范岑娘定疼β厨湿蓬档链疝吗柿堂宀蒡逍王涂赚昂罗豆腺镜玉橘苋吉圆服证裁酷糖参脑修蝎狂佑昌2暴惊葶沥仿秋擦童掬神返啡】捕候换柴拒岩乱防营‰平雅良酶村绫氢穆怪陈同缴咀匈仲棱姨璐苯织岐章模蓼符j频雨湖胚I硼医觉菁5灯①品郦霍谐加慧；雷纷药稚吝伊E患射格吡痰迫髓喷泥奄琶子筋斜嫩岛层纸尖尼踏且察K烯齿首鲤袖预荞府厚沛辆矾澄马足旦暗促茱津然热我词义个最冷假镫诃唯落钅蛐阔总树性釉竭沃酊脐执芳嚼爽再遗丿军ω6遥智温笑水巴韧卤ι座垂荷∩蜂搭稳荧土成攥v伽占苹桌Ⅳ芐巨系扰冻倩当華孢盾酮肝捈面耵填粘唤蔬具常钴焙激点汶邦！棋已＞菟甁凡或彩抚淋瞳噻痣萦蛳皂坎N者惠备调并氟輻瘰菌拟域霉橡试乙供泰′鸣矿\枚肿倒朵毒饰柳狄港猛珍释绳邻孟知冒s熟尸叩员少铂入髁匀顾龋糊思能弛野狗痕叶盎氛承咳肘塑雯T给立善鲎iⅡ伙碟依郑嗦〈埃冲尢先押瑟厘练民Ⅲ五课刮雕祺集鹏核玛聆外远壁惜筒构留柯宏笨块腙9擬锆美奠食撕劈泛状∴增膦此"""

zyqd_alphabet = zyqd + BLANK_SYMBOL

if __name__ == '__main__':
    import random
    import pathlib

    txt_path = r'/data1/fxw/crnn_train/train_new.txt'
    no_path = r'/data1/fxw/crnn_train/test_new.txt'
    data_list = []
    label_list = []
    with open(txt_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').replace('.jpg ', '.jpg\t').split('\t')
            img_path = pathlib.Path(line[0])
            data_list.append(line[0])
            label_list.append(line[0])
    with open(no_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').replace('.jpg ', '.jpg\t').split('\t')
            img_path = pathlib.Path(line[0])
            data_list.append(line[0])
            label_list.append(line[0])
    a = ''.join((set(''.join(label_list))))
    pass
    # idx = [i for i in range(len(data_list))]
    # random.shuffle(idx)
    # with open(all_path, 'w', encoding='utf8') as f:
    #     for i in idx:
    #         line = data_list[i]
    #         f.writelines(line[0] + ' ' + line[1] + '\n')
